tutorials/multiphase/MPPICInterFoam/twoPhasePachuka/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-2;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
         type            inletOutlet;
        inletValue       $internalField;
        value            $internalField;
    }

    walls
    {
        type             kqRWallFunction;
        value            $internalField;
    }

    base
    {
        type             kqRWallFunction;
        value            $internalField;
    }
}


// ************************************************************************* //
